* Always do first
Make it possible to eval src blocks with bash. Run this if the bedrock
hasn't been set up yet.
#+begin_src emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages '((emacs-lisp . t) (shell . t)))
#+end_src
#+RESULTS:
Once you install vterm you should be able to use the custom "C-c t" command to just copy/paste blocks to a vterm session
* tools for compiling vterm
#+begin_src bash
sudo dnf install cmake libtool
#+end_src
* Git config
#+begin_src bash
git config --global user.name "Nate Chodosh"
git config --global user.email "nchodosh@gmail.com"
git -C ~/dotfiles remote set-url origin git@github.qazmonk:qazmonk/dotfiles.git
#+end_src
* Setup bash + starship
** Set bash as default shell
Run this in a terminal (not org-babel — needs interactive password):
: chsh -s /bin/bash
** Install starship
#+begin_src bash
curl -sS https://starship.rs/install.sh | sh
#+end_src
** Link .bashrc
Back up existing .bashrc, then symlink ours:
#+begin_src bash
if [ -f ~/.bashrc ]; then mv ~/.bashrc ~/.bashrc.old; fi
ln -s ~/dotfiles/.bashrc.base ~/.bashrc
#+end_src
** Link starship.toml
#+begin_src bash
mkdir -p ~/.config
ln -s ~/dotfiles/starship.toml ~/.config/starship.toml
#+end_src
** Create .bashrc.local for machine-specific config
#+begin_src bash
touch ~/.bashrc.local
#+end_src
Put machine-specific settings here (conda paths, extra aliases, etc).
* Setup emacs bedrock
#+begin_src bash
set -x
mkdir -p ~/.emacs.d
ln -s ~/dotfiles/emacs-bedrock/init.el ~/.emacs.d/init.el
ln -s ~/dotfiles/emacs-bedrock/earl-init.el ~/.emacs.d/early-init.el
ln -s ~/dotfiles/emacs-bedrock/mixins ~/.emacs.d/mixins
#+end_src

#+RESULTS:
* Setup ~/Documents backup
** Decrypt the password file
HINT: The one with all the footnotes, check punctuation.
#+begin_src bash
gpg -d backup-passwords.env.gpg -o backup-passwords.env
#+end_src

#+RESULTS:

** Copy the service files
#+begin_src bash
mkdir -p ~/.config/systemd/user
cp -r ~/dotfiles/systemd/* ~/.config/systemd/user
#+end_src
#+RESULTS:
** Enable timers
#+begin_src bash
systemctl --user enable --now restic-backup.timer
systemctl --user enable --now restic-prune.timer
#+end_src
** Restore Documents
First list a few files to verify the snapshot contents:
#+begin_src bash
set -a; source ~/dotfiles/backup-passwords.env; set +a
restic -r s3:s3.us-east-005.backblazeb2.com/chodosh-backup-testing ls latest | head -10
#+end_src

Then restore for real:
#+begin_src bash
set -a; source ~/dotfiles/backup-passwords.env; set +a
restic -r s3:s3.us-east-005.backblazeb2.com/chodosh-backup-testing restore latest --target /
#+end_src
* Setup emacsclient desktop shortcut
#+begin_src bash
mkdir -p ~/.local/share/applications
ln -s ~/dotfiles/applications/emacsclient.desktop ~/.local/share/applications/emacsclient.desktop
#+end_src
* Setup emacs daemon
#+begin_src bash
mkdir -p ~/.config/systemd/user/emacs.service.d
ln -sf ~/dotfiles/systemd/emacs.service.d/override.conf ~/.config/systemd/user/emacs.service.d/override.conf
systemctl --user daemon-reload
systemctl --user reenable --now emacs
#+end_src

#+RESULTS:

* Setup syncthing
#+begin_src bash
systemctl --user enable --now syncthing
#+end_src
- Then open http://localhost:8384 to configure folders and devices
  - org-roam should go to ~/Documents/org-roam/daily/
  - org-run should go to ~/Documents/org-run/
* Setup tailscale
#+begin_src bash
sudo systemctl enable --now tailscaled
sudo tailscale up
#+end_src
* Old setup stuff
** Make bin directory for scripts
  #+BEGIN_SRC shell
    mkdir ~/dotfiles/bin
    cd cmds
    make all
  #+END_SRC

  #+RESULTS:
  | ln    | -sf | ~/dotfiles/cmds/calc.sh                 | ~/dotfiles/bin/calc                 |
  | chmod | a+x | ~/dotfiles/bin/calc                     |                                     |
  | ln    | -sf | ~/dotfiles/cmds/setup.sh                | ~/dotfiles/bin/setup                |
  | chmod | a+x | ~/dotfiles/bin/setup                    |                                     |
  | ln    | -sf | ~/dotfiles/cmds/editor.sh               | ~/dotfiles/bin/editor               |
  | chmod | a+x | ~/dotfiles/bin/editor                   |                                     |
  | ln    | -sf | ~/dotfiles/cmds/my-emacs.sh             | ~/dotfiles/bin/my-emacs             |
  | chmod | a+x | ~/dotfiles/bin/my-emacs                 |                                     |
  | ln    | -sf | ~/dotfiles/cmds/fix-git-author.sh       | ~/dotfiles/bin/fix-git-author       |
  | chmod | a+x | ~/dotfiles/bin/fix-git-author           |                                     |
  | ln    | -sf | ~/dotfiles/cmds/unison-sync-docs.sh     | ~/dotfiles/bin/unison-sync-docs     |
  | chmod | a+x | ~/dotfiles/bin/unison-sync-docs         |                                     |
  | ln    | -sf | ~/dotfiles/cmds/unison-last-sync.sh     | ~/dotfiles/bin/unison-last-sync     |
  | chmod | a+x | ~/dotfiles/bin/unison-last-sync         |                                     |
  | ln    | -sf | ~/dotfiles/cmds/connect-hdmi-display.sh | ~/dotfiles/bin/connect-hdmi-display |
  | chmod | a+x | ~/dotfiles/bin/connect-hdmi-display     |                                     |
  | ln    | -sf | ~/dotfiles/cmds/screen_autostart.sh     | ~/dotfiles/bin/screen_autostart     |
  | chmod | a+x | ~/dotfiles/bin/screen_autostart         |                                     |
  | ln    | -sf | ~/dotfiles/cmds/battery-notify.sh       | ~/dotfiles/bin/battery-notify       |
  | chmod | a+x | ~/dotfiles/bin/battery-notify           |                                     |
  | ln    | -sf | ~/dotfiles/cmds/input-test.sh           | ~/dotfiles/bin/input-test           |
  | chmod | a+x | ~/dotfiles/bin/input-test               |                                     |
  | ln    | -sf | ~/dotfiles/cmds/setup-bashrc.sh         | ~/dotfiles/bin/setup-bashrc         |
  | chmod | a+x | ~/dotfiles/bin/setup-bashrc             |                                     |
  | ln    | -sf | ~/dotfiles/cmds/setup-emacs.sh          | ~/dotfiles/bin/setup-emacs          |
  | chmod | a+x | ~/dotfiles/bin/setup-emacs              |                                     |
  | ln    | -sf | ~/dotfiles/cmds/unmntbox.sh             | ~/dotfiles/bin/unmntbox             |
  | chmod | a+x | ~/dotfiles/bin/unmntbox                 |                                     |
  | ln    | -sf | ~/dotfiles/cmds/make-ccl-script.sh      | ~/dotfiles/bin/make-ccl-script      |
  | chmod | a+x | ~/dotfiles/bin/make-ccl-script          |                                     |
  | ln    | -sf | ~/dotfiles/cmds/setup_dbus_address.sh   | ~/dotfiles/bin/setup_dbus_address   |
  | chmod | a+x | ~/dotfiles/bin/setup_dbus_address       |                                     |
  | ln    | -sf | ~/dotfiles/cmds/sbclcompile.sh          | ~/dotfiles/bin/sbclcompile          |
  | chmod | a+x | ~/dotfiles/bin/sbclcompile              |                                     |
** Link init.el to .emacs
  #+BEGIN_SRC shell
    make emacs-config
  #+END_SRC

  #+RESULTS:
  : ln -s ~/dotfiles/init.el ~/.emacs

#+RESULTS:
** Set up bashrc
  Two part bashrc: bashrc.global which has general shell helpers, and a .bashrc.local for anything you want specific to this machine. You should check .bashrc.lenovo for suggestions and whatever ends up in .bashrc.old which is the existing .bashrc
#+BEGIN_SRC shell
make bashrc
#+END_SRC

#+RESULTS:
| chmod | a+x | ~/dotfiles/.bashrc.global |           |    |      |    |           |                |    |
| if    | [   | -f                        | ~/.bashrc | ]; | then | mv | ~/.bashrc | ~/.bashrc.old; | fi |
| ln    | -s  | ~/dotfiles/.bashrc.base   | ~/.bashrc |    |      |    |           |                |    |

